Revit 2024 API
IFCConnectedWallData.Location Property
 The location for the join.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IFCConnectedWallDataLocation Location { get; }
Visual Basic
Public ReadOnly Property Location As IFCConnectedWallDataLocation
	Get
Visual C++
public:
property IFCConnectedWallDataLocation Location {
	IFCConnectedWallDataLocation get ();
}
See Also
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace